# -*- coding: UTF-8 -*-


# 地区与省份对应关系
region_map = {
    "香港": "港澳台",
    "澳门": "港澳台",
    "台湾": "港澳台",
    "北京": "华北地区",
    "天津": "华北地区",
    "河北": "华北地区",
    "山西": "华北地区",
    "内蒙古": "华北地区",
    "上海": "华东地区",
    "江苏": "华东地区",
    "浙江": "华东地区",
    "山东": "华东地区",
    "安徽": "华东地区",
    "辽宁": "东北地区",
    "吉林": "东北地区",
    "黑龙江": "东北地区",
    "湖北": "华中地区",
    "湖南": "华中地区",
    "河南": "华中地区",
    "江西": "华中地区",
    "广东": "华南地区",
    "广西": "华南地区",
    "海南": "华南地区",
    "福建": "华南地区",
    "四川": "西南地区",
    "重庆": "西南地区",
    "贵州": "西南地区",
    "云南": "西南地区",
    "西藏": "西南地区",
    "陕西": "西北地区",
    "甘肃": "西北地区",
    "新疆": "西北地区",
    "青海": "西北地区",
    "宁夏": "西北地区"
}

special_province = ["香港", "澳门", "台湾"]

special_cities = ["境外输入", "地区待确认"]
